turbq/atprog/packs/atmel/SAM3U_DFP/1.0.49/atdf/ATSAM3U4E.atdf
          </instance>
        </module>
        <module name="FUSES" version="1">
          <instance name="FUSES">
            <register-group address-space="fuses" name="GPNVMBITS" name-in-module="GPNVMBITS" offset="0"/>
          </instance>
        </module>
        <module name="LOCKBIT" version="1">
          <instance name="LOCKBIT">
            <register-group address-space="lockbits" name="LOCKBIT" name-in-module="LOCKBIT" offset="0"/>
          </instance>
        </module>
      <module name="SystemControl">
            <instance name="SystemControl">
                <register-group address-space="base" offset="0xE000E000" name-in-module="SystemControl" name="SystemControl"/>
            </instance>
        </module><module name="SysTick">
            <instance name="SysTick">
                <register-group address-space="base" offset="0xE000E010" name-in-module="SysTick" name="SysTick"/>
            </instance>
        </module><module name="NVIC">
            <instance name="NVIC">
                <register-group address-space="base" offset="0xE000E100" name-in-module="NVIC" name="NVIC"/>
            </instance>
        </module></peripherals>
      <interrupts>
        <interrupt index="-14" name="NonMaskableInt_IRQn" caption="Non Maskable Interrupt"/>
        <interrupt index="-13" name="HardFault_IRQn" caption="HardFault Interrupt"/>
        <interrupt index="-12" name="MemoryManagement_IRQn" caption="Cortex-M3 Memory Management Interrupt"/>
        <interrupt index="-11" name="BusFault_IRQn" caption="Cortex-M3 Bus Fault Interrupt"/>
        <interrupt index="-10" name="UsageFault_IRQn" caption="Cortex-M3 Usage Fault Interrupt"/>
        <interrupt index="-5" name="SVCall_IRQn" caption="Cortex-M3 SV Call Interrupt"/>
        <interrupt index="-4" name="DebugMonitor_IRQn" caption="Cortex-M3 Debug Monitor Interrupt"/>
        <interrupt index="-2" name="PendSV_IRQn" caption="Cortex-M3 Pend SV Interrupt"/>
        <interrupt index="-1" name="SysTick_IRQn" caption="Cortex-M3 System Tick Interrupt"/>
        <interrupt index="0" module-instance="SYSC" name="SUPC" caption="Supply Controller"/>
        <interrupt index="1" module-instance="SYSC" name="RSTC" caption="Reset Controller"/>
        <interrupt index="2" module-instance="SYSC" name="RTC" caption="Real Time Clock"/>
        <interrupt index="3" module-instance="SYSC" name="RTT" caption="Real Time Timer"/>
        <interrupt index="4" module-instance="SYSC" name="WDT" caption="Watchdog Timer"/>
        <interrupt index="5" module-instance="PMC" name="PMC" caption="Power Management Controller"/>
        <interrupt index="6" module-instance="EFC0" name="EFC0" caption="Enhanced Embedded Flash Controller 0"/>
        <interrupt index="7" module-instance="EFC1" name="EFC1" caption="Enhanced Embedded Flash Controller 1"/>
        <interrupt index="8" module-instance="UART" name="UART" caption="Universal Asynchronous Receiver Transmitter"/>
        <interrupt index="10" module-instance="PIOA" name="PIOA" caption="Parallel I/O Controller A,"/>
        <interrupt index="11" module-instance="PIOB" name="PIOB" caption="Parallel I/O Controller B"/>
        <interrupt index="12" module-instance="PIOC" name="PIOC" caption="Parallel I/O Controller C"/>
        <interrupt index="13" module-instance="USART0" name="USART0" caption="USART 0"/>
        <interrupt index="14" module-instance="USART1" name="USART1" caption="USART 1"/>
        <interrupt index="15" module-instance="USART2" name="USART2" caption="USART 2"/>
        <interrupt index="16" module-instance="USART3" name="USART3" caption="USART 3"/>
        <interrupt index="17" module-instance="HSMCI" name="HSMCI" caption="High Speed Multimedia Card Interface"/>
        <interrupt index="18" module-instance="TWI0" name="TWI0" caption="Two-Wire Interface 0"/>
        <interrupt index="19" module-instance="TWI1" name="TWI1" caption="Two-Wire Interface 1"/>
        <interrupt index="20" module-instance="SPI" name="SPI" caption="Serial Peripheral Interface"/>
        <interrupt index="21" module-instance="SSC" name="SSC" caption="Synchronous Serial Controller"/>
        <interrupt index="22" module-instance="TC0" name="TC0" caption="Timer Counter 0"/>
        <interrupt index="23" module-instance="TC0" name="TC1" caption="Timer Counter 1"/>
        <interrupt index="24" module-instance="TC0" name="TC2" caption="Timer Counter 2"/>
        <interrupt index="25" module-instance="PWM" name="PWM" caption="Pulse Width Modulation Controller"/>
        <interrupt index="26" module-instance="ADC12B" name="ADC12B" caption="12-bit ADC Controller"/>
        <interrupt index="27" module-instance="ADC" name="ADC" caption="10-bit ADC Controller"/>
        <interrupt index="28" module-instance="DMAC" name="DMAC" caption="DMA Controller"/>
        <interrupt index="29" module-instance="UDPHS" name="UDPHS" caption="USB Device High Speed"/>
      </interrupts>
      <interfaces>
        <interface type="samjtag" name="JTAG"/>
        <interface type="swd" name="SWD"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="JTAGID" value="0x05B2A01F"/>
          <property name="CHIPID_CIDR" value="0x28100960"/>
          <property name="CHIPID_EXID" value="0x0"/>
        </property-group>
      </property-groups>
      <parameters>
        <param name="__CM3_REV" value="0x0200"/>
        <param name="__MPU_PRESENT" value="1"/>
        <param name="__FPU_PRESENT" value="0"/>
        <param name="__NVIC_PRIO_BITS" value="4"/>
        <param name="__Vendor_SysTickConfig" value="0"/>
      </parameters>
    </device>
  </devices>
  <modules>
    <module caption="Analog-to-Digital Converter" name="ADC" version="6051K">
      <register-group name="ADC">
        <register caption="Control Register" name="ADC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
          <bitfield caption="Start Conversion" mask="0x00000002" name="START"/>
        </register>
        <register caption="Mode Register" name="ADC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Trigger Enable" mask="0x00000001" name="TRGEN"/>
          <bitfield caption="Trigger Selection" mask="0x0000000E" name="TRGSEL"/>
          <bitfield caption="Resolution" mask="0x00000010" name="LOWRES"/>
          <bitfield caption="Sleep Mode" mask="0x00000020" name="SLEEP"/>
          <bitfield caption="Prescaler Rate Selection" mask="0x0000FF00" name="PRESCAL"/>
          <bitfield caption="Start Up Time" mask="0x007F0000" name="STARTUP"/>
          <bitfield caption="Sample &amp; Hold Time" mask="0x0F000000" name="SHTIM"/>
        </register>
