turbq/atprog/packs/atmel/SAM3U_DFP/1.0.49/atdf/ATSAM3U4E.atdf
      <value-group caption="" name="RTC_SR__SEC">
        <value caption="No second event has occurred since the last clear." name="NO_SECEVENT" value="0"/>
        <value caption="At least one second event has occurred since the last clear." name="SECEVENT" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__TIMEV">
        <value caption="No time event has occurred since the last clear." name="NO_TIMEVENT" value="0"/>
        <value caption="At least one time event has occurred since the last clear." name="TIMEVENT" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__CALEV">
        <value caption="No calendar event has occurred since the last clear." name="NO_CALEVENT" value="0"/>
        <value caption="At least one calendar event has occurred since the last clear." name="CALEVENT" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x525443"/>
      </value-group>
    </module>
    <module caption="Real-time Timer" name="RTT" version="6081I">
      <register-group name="RTT">
        <register caption="Mode Register" name="RTT_MR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Real-time Timer Prescaler Value" mask="0x0000FFFF" name="RTPRES"/>
          <bitfield caption="Alarm Interrupt Enable" mask="0x00010000" name="ALMIEN"/>
          <bitfield caption="Real-time Timer Increment Interrupt Enable" mask="0x00020000" name="RTTINCIEN"/>
          <bitfield caption="Real-time Timer Restart" mask="0x00040000" name="RTTRST"/>
        </register>
        <register caption="Alarm Register" name="RTT_AR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Alarm Value" mask="0xFFFFFFFF" name="ALMV"/>
        </register>
        <register caption="Value Register" name="RTT_VR" offset="0x08" rw="R" size="4">
          <bitfield caption="Current Real-time Value" mask="0xFFFFFFFF" name="CRTV"/>
        </register>
        <register caption="Status Register" name="RTT_SR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Real-time Alarm Status" mask="0x00000001" name="ALMS"/>
          <bitfield caption="Real-time Timer Increment" mask="0x00000002" name="RTTINC"/>
        </register>
      </register-group>
    </module>
    <module caption="Static Memory Controller" name="SMC" version="6411D">
      <register-group name="SMC">
        <register caption="SMC NFC Configuration Register" name="SMC_CFG" offset="0x000" rw="RW" size="4">
          <bitfield caption="" mask="0x00000003" name="PAGESIZE" values="SMC_CFG__PAGESIZE"/>
          <bitfield caption="Write Spare Area" mask="0x00000100" name="WSPARE"/>
          <bitfield caption="Read Spare Area" mask="0x00000200" name="RSPARE"/>
          <bitfield caption="Rising/Falling Edge Detection Control" mask="0x00001000" name="EDGECTRL"/>
          <bitfield caption="Ready/Busy Signal Edge Detection" mask="0x00002000" name="RBEDGE"/>
          <bitfield caption="Data Timeout Cycle Number" mask="0x000F0000" name="DTOCYC"/>
          <bitfield caption="Data Timeout Multiplier" mask="0x00700000" name="DTOMUL" values="SMC_CFG__DTOMUL"/>
        </register>
        <register caption="SMC NFC Control Register" name="SMC_CTRL" offset="0x004" rw="W" size="4">
          <bitfield caption="NAND Flash Controller Enable" mask="0x00000001" name="NFCEN"/>
          <bitfield caption="NAND Flash Controller Disable" mask="0x00000002" name="NFCDIS"/>
        </register>
        <register caption="SMC NFC Status Register" name="SMC_SR" offset="0x008" rw="R" size="4">
          <bitfield caption="NAND Flash Controller status (this field cannot be reset)" mask="0x00000001" name="SMCSTS"/>
          <bitfield caption="Selected Ready Busy Rising Edge Detected" mask="0x00000010" name="RB_RISE"/>
          <bitfield caption="Selected Ready Busy Falling Edge Detected" mask="0x00000020" name="RB_FALL"/>
          <bitfield caption="NFC Busy (this field cannot be reset)" mask="0x00000100" name="NFCBUSY"/>
          <bitfield caption="NFC Write/Read Operation (this field cannot be reset)" mask="0x00000800" name="NFCWR"/>
          <bitfield caption="NFC Chip Select ID (this field cannot be reset)" mask="0x00007000" name="NFCSID"/>
          <bitfield caption="NFC Data Transfer Terminated" mask="0x00010000" name="XFRDONE"/>
          <bitfield caption="Command Done" mask="0x00020000" name="CMDDONE"/>
          <bitfield caption="Data Timeout Error" mask="0x00100000" name="DTOE"/>
          <bitfield caption="Undefined Area Error" mask="0x00200000" name="UNDEF"/>
          <bitfield caption="Accessing While Busy" mask="0x00400000" name="AWB"/>
          <bitfield caption="NFC Access Size Error" mask="0x00800000" name="NFCASE"/>
          <bitfield caption="Ready/Busy Line 0 Edge Detected" mask="0x01000000" name="RB_EDGE0"/>
        </register>
        <register caption="SMC NFC Interrupt Enable Register" name="SMC_IER" offset="0x00C" rw="W" size="4">
          <bitfield caption="Ready Busy Rising Edge Detection Interrupt Enable" mask="0x00000010" name="RB_RISE"/>
          <bitfield caption="Ready Busy Falling Edge Detection Interrupt Enable" mask="0x00000020" name="RB_FALL"/>
          <bitfield caption="Transfer Done Interrupt Enable" mask="0x00010000" name="XFRDONE"/>
          <bitfield caption="Command Done Interrupt Enable" mask="0x00020000" name="CMDDONE"/>
          <bitfield caption="Data Timeout Error Interrupt Enable" mask="0x00100000" name="DTOE"/>
          <bitfield caption="Undefined Area Access Interrupt Enable" mask="0x00200000" name="UNDEF"/>
          <bitfield caption="Accessing While Busy Interrupt Enable" mask="0x00400000" name="AWB"/>
          <bitfield caption="NFC Access Size Error Interrupt Enable" mask="0x00800000" name="NFCASE"/>
          <bitfield caption="Ready/Busy Line 0 Interrupt Enable" mask="0x01000000" name="RB_EDGE0"/>
        </register>
        <register caption="SMC NFC Interrupt Disable Register" name="SMC_IDR" offset="0x010" rw="W" size="4">
          <bitfield caption="Ready Busy Rising Edge Detection Interrupt Disable" mask="0x00000010" name="RB_RISE"/>
          <bitfield caption="Ready Busy Falling Edge Detection Interrupt Disable" mask="0x00000020" name="RB_FALL"/>
          <bitfield caption="Transfer Done Interrupt Disable" mask="0x00010000" name="XFRDONE"/>
          <bitfield caption="Command Done Interrupt Disable" mask="0x00020000" name="CMDDONE"/>
          <bitfield caption="Data Timeout Error Interrupt Disable" mask="0x00100000" name="DTOE"/>
          <bitfield caption="Undefined Area Access Interrupt Disable" mask="0x00200000" name="UNDEF"/>
          <bitfield caption="Accessing While Busy Interrupt Disable" mask="0x00400000" name="AWB"/>
          <bitfield caption="NFC Access Size Error Interrupt Disable" mask="0x00800000" name="NFCASE"/>
          <bitfield caption="Ready/Busy Line 0 Interrupt Disable" mask="0x01000000" name="RB_EDGE0"/>
        </register>
        <register caption="SMC NFC Interrupt Mask Register" name="SMC_IMR" offset="0x014" rw="R" size="4">
          <bitfield caption="Ready Busy Rising Edge Detection Interrupt Mask" mask="0x00000010" name="RB_RISE"/>
          <bitfield caption="Ready Busy Falling Edge Detection Interrupt Mask" mask="0x00000020" name="RB_FALL"/>
          <bitfield caption="Transfer Done Interrupt Mask" mask="0x00010000" name="XFRDONE"/>
          <bitfield caption="Command Done Interrupt Mask" mask="0x00020000" name="CMDDONE"/>
          <bitfield caption="Data Timeout Error Interrupt Mask" mask="0x00100000" name="DTOE"/>
          <bitfield caption="Undefined Area Access Interrupt Mask5" mask="0x00200000" name="UNDEF"/>
          <bitfield caption="Accessing While Busy Interrupt Mask" mask="0x00400000" name="AWB"/>
          <bitfield caption="NFC Access Size Error Interrupt Mask" mask="0x00800000" name="NFCASE"/>
          <bitfield caption="Ready/Busy Line 0 Interrupt Mask" mask="0x01000000" name="RB_EDGE0"/>
        </register>
